In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('adult.data.csv')

df

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32556,27,Private,257302,Assoc-acdm,12,Married-civ-spouse,Tech-support,Wife,White,Female,0,0,38,United-States,<=50K
32557,40,Private,154374,HS-grad,9,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40,United-States,>50K
32558,58,Private,151910,HS-grad,9,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40,United-States,<=50K
32559,22,Private,201490,HS-grad,9,Never-married,Adm-clerical,Own-child,White,Male,0,0,20,United-States,<=50K
32560,52,Self-emp-inc,287927,HS-grad,9,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States,>50K

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             32561 non-null  int64
 1   workclass       32561 non-null  object
 2   fnlwgt          32561 non-null  int64
 3   education       32561 non-null  object
 4   education-num   32561 non-null  int64
 5   marital-status  32561 non-null  object
 6   occupation      32561 non-null  object
 7   relationship    32561 non-null  object
 8   race            32561 non-null  object
 9   sex             32561 non-null  object
 10  capital-gain    32561 non-null  int64
 11  capital-loss    32561 non-null  int64
 12  hours-per-week  32561 non-null  int64
 13  native-country  32561 non-null  object
 14  salary          32561 non-null  object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

In [4]:
df.describe()

,age,fnlwgt,education-num,capital-gain,capital-loss,hours-per-week
count,32561.000000,3.256100e+04,32561.000000,32561.000000,32561.000000,32561.000000
mean,38.581647,1.897784e+05,10.080679,1077.648844,87.303830,40.437456
std,13.640433,1.055500e+05,2.572720,7385.292085,402.960219,12.347429
min,17.000000,1.228500e+04,1.000000,0.000000,0.000000,1.000000
25%,28.000000,1.178270e+05,9.000000,0.000000,0.000000,40.000000
50%,37.000000,1.783560e+05,10.000000,0.000000,0.000000,40.000000
75%,48.000000,2.370510e+05,12.000000,0.000000,0.000000,45.000000
max,90.000000,1.484705e+06,16.000000,99999.000000,4356.000000,99.000000

In [5]:
df.groupby('education')['education-num'].first().reset_index(name = 'education_num')

       education  education_num
0           10th              6
1           11th              7
2           12th              8
3        1st-4th              2
4        5th-6th              3
5        7th-8th              4
6            9th              5
7     Assoc-acdm             12
8      Assoc-voc             11
9      Bachelors             13
10     Doctorate             16
11       HS-grad              9
12       Masters             14
13     Preschool              1
14   Prof-school             15
15  Some-college             10

In [6]:
df['education'].value_counts().reset_index(name = 'Count')

       education  Count
0        HS-grad  10501
1   Some-college   7291
2      Bachelors   5355
3        Masters   1723
4      Assoc-voc   1382
5           11th   1175
6     Assoc-acdm   1067
7           10th    933
8        7th-8th    646
9    Prof-school    576
10           9th    514
11          12th    433
12     Doctorate    413
13       5th-6th    333
14       1st-4th    168
15     Preschool     51

In [7]:
race_count = df['race'].value_counts()
print(race_count)

race
White                 27816
Black                  3124
Asian-Pac-Islander     1039
Amer-Indian-Eskimo      311
Other                   271
Name: count, dtype: int64

In [8]:
men_df = df[df['sex'] == 'Male']

men_ages = men_df['age']

average_age_men = men_ages.mean()

print(average_age_men)

39.43354749885268

In [9]:
total_people = len(df)
education_count = df['education'].value_counts().reset_index(name = 'Count')
education_count.set_index('education', inplace = True)
bachelor_count = education_count.loc['Bachelors', 'Count']
percentage_bachelors = bachelor_count/total_people * 100
print(percentage_bachelors)

16.44605509658794

In [10]:
higher_education_tot = df['education'].isin(['Bachelors', 'Masters', 'Doctorate'])
higher_education_rich = df[higher_education_tot & (df['salary'] == '>50K')].shape[0]
percentage_higher_education_rich = (higher_education_rich / df[higher_education_tot].shape[0]) * 100
print(percentage_higher_education_rich)

46.535843011613935

In [11]:
lower_education_tot = ~df['education'].isin(['Bachelors', 'Masters', 'Doctorate'])
lower_education_rich = df[lower_education_tot & (df['salary'] == '>50K')].shape[0]
percentage_lower_education_rich = (lower_education_rich / df[lower_education_tot].shape[0]) * 100
print(percentage_lower_education_rich)

17.3713601914639

In [12]:
higher_education = df[higher_education_tot].shape[0]
lower_education = df[lower_education_tot].shape[0]

print(higher_education)
print(lower_education)

7491
25070

In [13]:
min_work_hours = df['hours-per-week'].min()

min_work_hours

1

In [14]:
num_min_workers = df[df['hours-per-week'] == min_work_hours].shape[0]

num_min_workers

20

In [15]:
num_min_workers = df[df['hours-per-week'] == min_work_hours].shape[0]
rich_percentage_min_workers = (df[(df['hours-per-week'] == min_work_hours) & (df['salary'] == '>50K')].shape[0] / num_min_workers) * 100
print(rich_percentage_min_workers)

10.0

In [16]:
country_earning = df[df['salary'] == '>50K']['native-country'].value_counts()
country_total = df['native-country'].value_counts()
highest_earning_country = (country_earning / country_total * 100).idxmax()
highest_earning_country_percentage = (country_earning / country_total * 100).max()
print(highest_earning_country, highest_earning_country_percentage)

Iran 41.86046511627907

In [17]:
country_earning = df[df['salary'] == '>50K']['native-country'].value_counts()

country_earning

native-country
United-States         7171
?                      146
Philippines             61
Germany                 44
India                   40
Canada                  39
Mexico                  33
England                 30
Italy                   25
Cuba                    25
Japan                   24
Taiwan                  20
China                   20
Iran                    18
South                   16
Puerto-Rico             12
Poland                  12
France                  12
Jamaica                 10
El-Salvador              9
Greece                   8
Cambodia                 7
Hong                     6
Yugoslavia               6
Ireland                  5
Vietnam                  5
Portugal                 4
Haiti                    4
Ecuador                  4
Thailand                 3
Hungary                  3
Guatemala                3
Scotland                 3
Nicaragua                2
Trinadad&Tobago          2
Laos                     2
Columbia                 2
Dominican-Republic       2
Peru                     2
Honduras                 1
Name: count, dtype: int64

In [18]:
country_total = df['native-country'].value_counts()

country_total

native-country
United-States                 29170
Mexico                          643
?                               583
Philippines                     198
Germany                         137
Canada                          121
Puerto-Rico                     114
El-Salvador                     106
India                           100
Cuba                             95
England                          90
Jamaica                          81
South                            80
China                            75
Italy                            73
Dominican-Republic               70
Vietnam                          67
Guatemala                        64
Japan                            62
Poland                           60
Columbia                         59
Taiwan                           51
Haiti                            44
Iran                             43
Portugal                         37
Nicaragua                        34
Peru                             31
France                           29
Greece                           29
Ecuador                          28
Ireland                          24
Hong                             20
Cambodia                         19
Trinadad&Tobago                  19
Laos                             18
Thailand                         18
Yugoslavia                       16
Outlying-US(Guam-USVI-etc)       14
Honduras                         13
Hungary                          13
Scotland                         12
Holand-Netherlands                1
Name: count, dtype: int64

In [19]:
highest_earning_country = (country_earning / country_total * 100).idxmax()

highest_earning_country

'Iran'

In [20]:
top_IN_occupation = df[(df['native-country'] == 'India') & (df['salary'] == '>50K')]['occupation'].value_counts().idxmax()
print(top_IN_occupation)

Prof-specialty

In [21]:
df[(df['native-country'] == 'India') & (df['salary'] == '>50K')]['occupation'].value_counts()

occupation
Prof-specialty      25
Exec-managerial      8
Other-service        2
Tech-support         2
Transport-moving     1
Sales                1
Adm-clerical         1
Name: count, dtype: int64